<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"29d4e3149db9fc39363a2edbb98b7994e06fdfb6ea4056b4aaacf18c1925c4b8","plan_job_ref":"Job .github/workflows/_test-tf.yaml #243 at https://github.com/tx-pts-dai/github-workflows/actions/runs/13302940294","plan_out_hash":"7d7906819251e3aec15caced5858ef91948fe0c878347a089992fc21c40f7f0b","plan_hash":"e21ec85aa35c88ad472705585e39bb55f8b05ea2dddfe80a4d4d4c7cf414cca2","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #243](https://github.com/tx-pts-dai/github-workflows/actions/runs/13302940294)